# 01. Importing libraries

In [1]:
#import libraries
import pandas as pd
import numpy as np
import os

# 02. Importing data

In [2]:
#create a path
path = r'C:\Users\Maya\OneDrive\Documents\CareerFoundry\Achievement 4 - Python Fundamentals for Data Analysts\Jupyter Instacart Basket Analysis'
#import orders_wrangled.csv
df_ords = pd.read_csv(os.path.join(path, 'Data', 'Prepared Data', 'orders_wrangled.csv'), index_col = False)
#import products.csv
df_prods = pd.read_csv(os.path.join(path, 'Data', 'Original Data', 'products.csv'), index_col = False)

# 03. Mixed data types

In [3]:
#create a dataframe
df_test = pd.DataFrame()
#make a column of mixed data types
df_test['mix'] = ['a', 'b', 1, True]
df_test.head()

    mix
0     a
1     b
2     1
3  True

In [4]:
#checking column for mixed data types
for col in df_test.columns.tolist():
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

mix

In [5]:
#setting data type to string
df_test['mix'] = df_test['mix'].astype('str')

# 04. Missing values

In [6]:
# counting the amount of missing values in products.csv
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [7]:
#creating a subset of the missing values in products.csv
df_nan = df_prods[df_prods['product_name'].isnull() == True]
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [8]:
df_prods.shape

(49693, 5)

In [9]:
#dropping missing values from products.csv
df_prods = df_prods[df_prods['product_name'].isnull() == False]
df_prods.shape

(49677, 5)

In [10]:
#checking for duplicates in products.csv
df_dups = df_prods[df_prods.duplicated()]
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [11]:
#dropping duplicates from products.csv
df_prods = df_prods.drop_duplicates()
df_prods.shape

(49672, 5)

# Step 2

In [12]:
#Run the df.describe() function on your df_prods dataframe. 
#Using your new knowledge about how to interpret the output 
#of this function, share in a markdown cell whether anything 
#about the data looks off or should be investigated further.

df_prods.describe()

         product_id      aisle_id  department_id        prices
count  49672.000000  49672.000000   49672.000000  49672.000000
mean   24850.349775     67.762442      11.728942      9.993282
std    14340.705287     38.315784       5.850779    453.615536
min        1.000000      1.000000       1.000000      1.000000
25%    12432.750000     35.000000       7.000000      4.100000
50%    24850.500000     69.000000      13.000000      7.100000
75%    37268.250000    100.000000      17.000000     11.100000
max    49688.000000    134.000000      21.000000  99999.000000

The maximum price is 99999, which is unrealistic

# Fixing Outliers in df_prods

In [13]:
df_prods.nlargest(5, ['prices'])

,product_id,product_name,aisle_id,department_id,prices
33666,33664,2 % Reduced Fat Milk,84,16,99999.0
21554,21553,Lowfat 2% Milkfat Cottage Cheese,108,16,14900.0
9020,9020,Boneless Skinless Chicken Thighs,35,12,25.0
19392,19391,Turkey Breast Tenderloins,49,12,25.0
21468,21467,Wild Caught Raw Shrimp,15,12,25.0

In [18]:
df_prods_clean = df_prods[df_prods.prices != 99999]
#df_prods_clean.nlargest(5, ['prices'])
df_prods_clean.describe()

         product_id      aisle_id  department_id        prices
count  49670.000000  49670.000000   49670.000000  49670.000000
mean   24850.238716     67.761305      11.728770      7.680437
std    14340.931850     38.316060       5.850834      4.199381
min        1.000000      1.000000       1.000000      1.000000
25%    12432.250000     35.000000       7.000000      4.100000
50%    24850.500000     69.000000      13.000000      7.100000
75%    37268.750000    100.000000      17.000000     11.100000
max    49688.000000    134.000000      21.000000     25.000000

In [19]:
df_prods_clean.shape

(49670, 5)

In [20]:
df_prods_clean.nlargest(5, ['prices'])

,product_id,product_name,aisle_id,department_id,prices
9020,9020,Boneless Skinless Chicken Thighs,35,12,25.0
19392,19391,Turkey Breast Tenderloins,49,12,25.0
21468,21467,Wild Caught Raw Shrimp,15,12,25.0
25580,25579,Naturally Smoked Trout Fillet,15,12,25.0
40490,40486,Chicken Tenders,49,12,25.0

In [21]:
df_prods_clean.to_csv(os.path.join(path, 'Data', 'Prepared Data', 'products_clean.csv'))

# Step 3

In [ ]:
#Check for mixed-type data in your df_ords dataframe.

for col in df_ords.columns.tolist():
  weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_ords[weird]) > 0:
    print (col)

# Step 4

In [ ]:
#If you find mixed-type data, fix it. The column in 
#question should contain observations of a single data type.

#mixed-type data was not found

# Step 5

In [ ]:
#Run a check for missing values in your df_ords dataframe.

df_ords.isnull().sum()

# Step 6

In [ ]:
#Address the missing values using an appropriate method.

There would be a missing value for a customer's first order in the 
days_since_prior_order column since there is no prior information to compare to. Therefore it should be left as is

# Step 7

In [ ]:
#Run a check for duplicate values in your df_ords data.

df_ords_dups = df_ords[df_ords.duplicated()]
df_ords_dups

# Step 8

In [ ]:
#Address the duplicates using an appropriate method.

#no duplicates were found

# Step 9

In [ ]:
#Export your final, cleaned df_prods and df_ords data 
#as “.csv” files in your “Prepared Data” folder and 
#give them appropriate, succinct names.

#df_prods.to_csv(os.path.join(path, 'Data', 'Prepared Data', 'products_clean.csv'))
#no changes were made to df_ords